In [42]:
import pandas as pd

cars_html = pd.read_html("https://en.wikipedia.org/wiki/Comma-separated_values")

In [43]:
len(cars_html)

2

In [44]:
cars_df = cars_html[1]
cars_df

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000.0
1,1999,Chevy,"Venture ""Extended Edition""",NaN,4900.0
2,1999,Chevy,"Venture ""Extended Edition, Very Large""",NaN,5000.0
3,1996,Jeep,Grand Cherokee,"MUST SELL!air, moon roof, loaded",4799.0

In [45]:
type(cars_df)

pandas.core.frame.DataFrame

In [49]:
cars_df.to_csv("Cars.txt",
              index = False)

In [48]:
pd.read_csv("Cars.txt")

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000.0
1,1999,Chevy,"Venture ""Extended Edition""",NaN,4900.0
2,1999,Chevy,"Venture ""Extended Edition, Very Large""",NaN,5000.0
3,1996,Jeep,Grand Cherokee,"MUST SELL!air, moon roof, loaded",4799.0